#1) რა არის Keyword-ები და რას ნიშნავს რეზერვირებული სიტყვა
#Keyword-ები ანუ საკვანძო სიტყვები — ეს არის სიტყვები, რომლებსაც Python იყენებს საკუთარი სინტაქსისათვის.
#მათ კონკრეტული მნიშვნელობა აქვთ და ჩვენ არ შეგვიძლია მათი ცვლადად გამოყენება.

#2) Indexing და Slicing
#Indexing (ინდექსაცია)

#გამოიყენება იმისთვის, რომ მოვძებნოთ კონკრეტული ელემენტი სიის (list), სტრიქონის (string) ან ტუპლის (tuple) შიგნით.

#Python-ში ინდექსაცია იწყება 0-დან.

#2) Indexing და Slicing
#Indexing (ინდექსაცია)

#გამოიყენება იმისთვის, რომ მოვძებნოთ კონკრეტული ელემენტი სიის (list), სტრიქონის (string) ან ტუპლის (tuple) შიგნით.

#Python-ში ინდექსაცია იწყება 0-დან.

#ფუნქცია გამოიყენება კოდის დასალაგებლად და ხელახალი გამოყენებისთვის.
#def ნიშნავს define function — ანუ ფუნქციის განსაზღვრა.


	#for loop	while loop
#იზანი	გადაუაროს ელემენტებს თანმიმდევრობაში	იმეორებს მანამ, სანამ პირობა ჭეშმარიტია
#სინტაქსი	for i in range(5):	while condition:
#გამოყენება

