#Indexing გვაძლევს ერთ ელემენტს კონკრეტული ინდექსით.

#Slicing გვაძლევს რამდენიმე ელემენტს ერთდროულად.

# append()  ამატებს ახალ ელემენტს ლისტის ბოლოში.

# insert()  ამატებს ელემენტს მითითებულ პოზიციაზე.

# remove()  შლის ლისტიდან პირველივე ელემენტს, რომელიც ტოლია x-ის.

# pop(i) შლის ელემენტს ინდექსით (თუ არ გადავაწერთ, შლის ბოლო ელემენტს).

#join()  მისი ამოცანაა სიაში ან კოლექციაში არსებული სტრიქონები გააერთიანოს ერთ სტრიქონად, იმ სიმბოლოთი, რომელიც შენ აირჩევ.

#  print

# ეკრანზე გამოაქვს ინფორმაცია (გამოაქვს ტექსტი, რიცხვი და ა.შ. კონსოლში).

# გამოიყენება მხოლოდ ჩვენთვის საჩვენებლად (debugging, შედეგის ჩვენება მომხმარებლისთვის).

# არ აბრუნებს მნიშვნელობას პროგრამაში  


#return

#ფუნქციიდან აბრუნებს მნიშვნელობას უკან, რათა მას შემდეგ გამოიყენო სხვა კოდში.

#return-ის შემდეგ ფუნქცია წყდება და აბრუნებს შედეგს.

#დაბრუნებული მნიშვნელობა შეგიძლია შეინახო ცვლადში ან სხვა გამოთვლებში გამოიყენო.

#ცვლადი (Variable)

#ცვლადი არის ერთი კონტეინერი, სადაც ინახება მხოლოდ ერთი მნიშვნელობა ერთდროულად.

#შეგიძლია ცვლადს მიანიჭო რიცხვი, ტექსტი, ბულეანი

# List (სია)

# List არის ცვლადის განსაკუთრებული ტიპი, სადაც შეგიძლია ერთდროულად რამდენიმე მნიშვნელობის შენახვა.

# ელემენტები ინახება მიმდევრობით (index-ებით).

# შეგიძლია სიაში შეინახო როგორც რიცხვები, ასევე ტექსტები, ან ერთმანეთის კომბინაცია 