
#return	აბრუნებს მნიშვნელობას ფუნქციიდან პროგრამის სხვა ნაწილში. შედეგი ინახება, შეიძლება გადავინახოთ ცვლადში, გამოვიყენოთ გამოთვლებში და ა.შ.	როცა გვჭირდება ფუნქციის მიერ გამოთვლილი მონაცემის შენახვა ან შემდგომი დამუშავება.
#print	უბრალოდ აჩვენებს ინფორმაციას ეკრანზე (კონსოლში), მაგრამ არ აბრუნებს მნიშვნელობას.	როცა გვინდა მხოლოდ დავბეჭდოთ შედეგი მომხმარებლისთვის

def ფუნქციის_სახელი(პარამეტრები):
    # კოდი, რომელიც ფუნქციამ უნდა შეასრულოს
    return მნიშვნელობა   # სურვილისამებრ

#Keyword (საკვანძო სიტყვა) — ეს არის  დაცული სიტყვები Python-ში, რომლებიც ენას აქვს განსაზღვრული კონკრეტული დანიშნულებით. მათ ვერ გამოვიყენებთ ცვლადის სახელად.



#მაგალითად False, True, None, and, as, assert, break, class, continue, def,
#del, elif, else, except, finally, for, from, global, if, import,
#n, is, lambda, nonlocal, not, or, pass, raise, return, try,
#while, with, yield