#ამოიყენება სტრინგის ყველა სიმბოლოს დიდად (uppercase) გადასაყვანად.
#გამოიყენება სტრინგის ყველა სიმბოლოს პატარად (lowercase) გადასაყვანად.
#ამ ფუნქციით სტრინგის პირველი ასო დიდი ხდება, დანარჩენები კი პატარები.
# ეძებს გადაცემულ ტექსტს სტრინგში და აბრუნებს პირველი დამთხვევის ინდექსს. თუ ვერ იპოვა 
# – აბრუნებს -1.
# დოტ ნოტაციa — ეს არის სინტაქსი, რომელ,იც გამოიყენება ობიექტებსა  წევრების
# მისაწვდომად. len()
#len გამოიყენება ელემენტების რაოდენობის დასადგენად.
#append გამოიყენება ახალი ელემენტის დამატებისთვის სიის ბოლოს.
# insert ამატებს ელემენტს სიის მითითებულ  ინდექსზე.
#აშორებს და აბრუნებს ელემენტს სიის მითითებული ინდექსიდან  თუ ინდექსი არ მითითდა.
#სინტაქსი:list.pop([index])

#ეს არის Python-ში უკვე ჩაშენებული ფუნქცია, რომელიც იღებს არგუმენტს და აბრუნებს შედეგს.
#მეთოდი არის ფუნქცია, რომელიც დაკავშირებულია კონკრეტულ ობიექტთან და იძახება დოტ ნოტაციით.